export const authRequiredCopy = {
  favorites: {
    title: "ورود به حساب کاربری",
    description:
      "برای افزودن غذا به علاقه‌مندی‌ها ابتدا وارد حساب کاربری خود شوید.",
  },

  comments: {
    title: "ورود به حساب کاربری",
    description: "برای مشاهده و ثبت نظر ابتدا وارد حساب کاربری خود شوید.",
  },
  profile: {
    title: "ورود به حساب کاربری",
    description: "برای مشاهده پروفایل باید وارد شوید.",
  },

  music: {
    title: "ورود به حساب کاربری",
    description: "برای درخواست موسیقی ابتدا وارد حساب کاربری خود شوید.",
  },

  orders: {
    title: "ورود به حساب کاربری",
    description: "برای مشاهده سفارش‌های خود باید وارد حساب کاربری خود شوید.",
  },

  default: {
    title: "ورود به حساب کاربری",
    description: "برای ادامه باید وارد حساب کاربری خود شوید.",
  },
};
